In [1]:
# Data Aggregation and group operations

In [2]:
#Group by Mechanics

In [3]:
import pandas as pd, numpy as np

In [4]:
df = pd.DataFrame(
            {
                'key1': ['a','a','b', 'b', 'a'],
                'key2': ['one', 'two', 'one', 'two', 'one'],
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)
            }
)

In [5]:
df

  key1 key2     data1     data2
0    a  one  0.198062 -0.328101
1    a  two  0.235790  0.467234
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703
4    a  one -0.233397 -0.392920

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a    0.066818
b    1.024169
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.017668
      two     0.235790
b     one     0.181283
      two     1.867056
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.017668  0.235790
b     0.181283  1.867056

In [12]:
states = np.array(['Ohio','California','California','Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
states, years

(array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10'),
 array([2005, 2005, 2006, 2005, 2006]))

In [15]:
df['data1'].groupby([states, years]).mean()

California  2005    0.235790
            2006    0.181283
Ohio        2005    1.032559
            2006   -0.233397
Name: data1, dtype: float64

In [16]:
df

  key1 key2     data1     data2
0    a  one  0.198062 -0.328101
1    a  two  0.235790  0.467234
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703
4    a  one -0.233397 -0.392920

In [17]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [21]:
df.groupby(['key1'])

In [23]:
#iterating over groups

In [25]:
df.groupby('key1').describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.066818  0.260678 -0.233397 -0.017668  0.198062  0.216926
b      2.0  1.024169  1.192021  0.181283  0.602726  1.024169  1.445613

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.235790   3.0 -0.084596  0.478996 -0.392920 -0.360511 -0.328101
b     1.867056   2.0  0.580143  0.335961  0.342583  0.461363  0.580143


           75%       max
key1
a     0.069566  0.467234
b     0.698923  0.817703

In [27]:
for name, group in df.groupby('key1'):
    print('name',name)
    print('group',group)

name a
group   key1 key2     data1     data2
0    a  one  0.198062 -0.328101
1    a  two  0.235790  0.467234
4    a  one -0.233397 -0.392920
name b
group   key1 key2     data1     data2
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703

In [28]:
df

  key1 key2     data1     data2
0    a  one  0.198062 -0.328101
1    a  two  0.235790  0.467234
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703
4    a  one -0.233397 -0.392920

In [30]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.198062 -0.328101
4    a  one -0.233397 -0.392920
('a', 'two')
  key1 key2    data1     data2
1    a  two  0.23579  0.467234
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.181283  0.342583
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.867056  0.817703

In [31]:
df

  key1 key2     data1     data2
0    a  one  0.198062 -0.328101
1    a  two  0.235790  0.467234
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703
4    a  one -0.233397 -0.392920

In [32]:
list(df.groupby('key1'))

[('a',   key1 key2     data1     data2
  0    a  one  0.198062 -0.328101
  1    a  two  0.235790  0.467234
  4    a  one -0.233397 -0.392920), ('b',   key1 key2     data1     data2
  2    b  one  0.181283  0.342583
  3    b  two  1.867056  0.817703)]

In [33]:
pieces = dict(list(df.groupby('key1')))

In [34]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.198062 -0.328101
 1    a  two  0.235790  0.467234
 4    a  one -0.233397 -0.392920, 'b':   key1 key2     data1     data2
 2    b  one  0.181283  0.342583
 3    b  two  1.867056  0.817703}

In [36]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703

In [37]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [38]:
grouped = df.groupby(df.dtypes, axis=1)

In [39]:
grouped

In [40]:
for a, b in grouped:
    print(a)
    print(b)

float64
      data1     data2
0  0.198062 -0.328101
1  0.235790  0.467234
2  0.181283  0.342583
3  1.867056  0.817703
4 -0.233397 -0.392920
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [41]:
df

  key1 key2     data1     data2
0    a  one  0.198062 -0.328101
1    a  two  0.235790  0.467234
2    b  one  0.181283  0.342583
3    b  two  1.867056  0.817703
4    a  one -0.233397 -0.392920

In [42]:
grouped0 = df.groupby(df.dtypes, axis=0)

In [43]:
grouped0

In [45]:
for a, b in grouped0:
    print(a)
    print(b)